Autodesk.Revit.UI.NumberingFilterInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.NumberingFilterInfo.Id
Since:
2027

Autodesk.Revit.UI.NumberingFilterInfo.Name
Since:
2027

Autodesk.Revit.UI.NumberingFilterInfo
This class represents a filter id and it's name when it can be used for numbering.
Since:
2027